import 'dart:math';
class BmiCalculator{
  double bmi({required double height,required int weight }){
  final res = weight / pow(height/100,2);
  return res;
  }
 // Метод bmi вычисляет индекс массы тела (BMI) на основе переданных значений роста (height) и веса (weight).

String bmiResult(res) {
  if (res<= 18.5){
    //print('сиз арыксыз:$res');
    return 'Сиз арыксыз';
    }else if (res >= 18.6 && res <=25){
      //print ('Сиздин салмагыныз ноормалдуу:$res');
      return 'Нормалдуу';
    } else if (res >=25.1 && res <=30) {
      //print ('Сиз ашыкча салмактуусуз:$res');
       return 'Сиз ашыкча салмактуусуз';
    } else {
     return 'Сиз семизсиз';
    }
    }
  
// Метод bmiResult определяет результат на основе значения индекса массы тела (res).
  // Возвращает соответствующую категорию в зависимости от значения индекса массы тела.

String bmiDescription(res) {
  if (res<= 18.5){
    //print('сиз арыксыз:$res');
    return 'Сиз арыксыз,тамактануу норманызды карап коюнуз шарт';
    }else if (res >= 18.6 && res <=25){
      //print ('Сиздин салмагыныз ноормалдуу:$res');
      return 'Сиздин дене салмагыныз нормалдуу. Азаматсыз! ';
    } else if (res >=25.1 && res <=30) {
      //print ('Сиз ашыкча салмактуусуз:$res');
       return 'Сиз ашыкча салмактуу экенсиз, спорт менен алектениниз';
    } else {
     return 'Сиз семизсиз, срочно фитнес клубка барыныз!! Аз жениз!';
    }
    }
   // Метод bmiDescription определяет описание результата на основе значения индекса массы тела (res).
  // Возвращает соответствующее описание в зависимости от значения индекса массы тела.
}